0/omega
/*--------------------------------*- C++ -*----------------------------------*\\
  =========                 |
  \\\\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\\\    /   O peration     | Website:  https://openfoam.org
    \\\\  /    A nd           | Version:  11
     \\\\/     M anipulation  |
\\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1.78;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1.78;
    }
    outlet
    {
        type            zeroGradient;
    }
    ground
    {
        type            omegaWallFunction;
        value           uniform 1.78;
    }
    topAndSides
    {
        type            symmetry;
    }
    "(body.*|tires.*|frame.*)"
    {
        type            omegaWallFunction;
        value           uniform 1.78;
    }
}

// ************************************************************************* //
