system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\\
  =========                 |
  \\\\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\\\    /   O peration     | Website:  https://openfoam.org
    \\\\  /    A nd           | Version:  11
     \\\\/     M anipulation  |
\\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

// 風洞のサイズ (単位 m)
// x: 流れ方向 (-5 m to 10 m)
// y: 横方向 (-3 m to 3 m)
// z: 高さ方向 (0 m to 4 m)

vertices
(
    (-5 -3  0) // 0
    (10 -3  0) // 1
    (10  3  0) // 2
    (-5  3  0) // 3
    (-5 -3  4) // 4
    (10 -3  4) // 5
    (10  3  4) // 6
    (-5  3  4) // 7
);

blocks
(
    // 粗めのバックグラウンドメッシュ (x:30, y:20, z:15分割)
    hex (0 1 2 3 4 5 6 7) (30 20 15) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    topAndSides
    {
        type symmetry;
        faces
        (
            (4 5 6 7)
            (0 1 5 4)
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
