system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\\
  =========                 |
  \\\\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\\\    /   O peration     | Website:  https://openfoam.org
    \\\\  /    A nd           | Version:  11
     \\\\/     M anipulation  |
\\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         300; // 簡易計算のため300イテレーション

deltaT          1;
writeControl    timeStep;
writeInterval   20;

purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;

functions
{
    forces_all
    {
        type            forces;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   1;

        // 全てのSTLを対象とする正規表現
        patches         ("(body.*|tires.*|frame.*)");
        
        rho             rhoInf;
        rhoInf          1.225; // 空気密度 kg/m^3
        CofR            (0 0 0);
    }

    forceCoeffs_all
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        writeInterval   1;

        patches         ("(body.*|tires.*|frame.*)");
        
        rho             rhoInf;
        rhoInf          1.225;
        CofR            (0 0 0);
        liftDir         (0 0 1);
        dragDir         (1 0 0);
        pitchAxis       (0 1 0);
        
        magUInf         20.0; // 後でPythonから書き換えるとより正確だが今回は代表値
        lRef            1.5;  // 代表長さ m
        Aref            1.0;  // 代表面積 m^2
    }
}
// ************************************************************************* //
